In [58]:
import pandas as pd

In [59]:
dt=pd.DataFrame({"a":[1,2,3,4,5],"b":[2,3,4,5,6]})

In [60]:
dt

   a  b
0  1  2
1  2  3
2  3  4
3  4  5
4  5  6

In [61]:
import numpy as np

In [62]:
dt.a=dt.a.apply(np.ceil)

In [63]:
dt

     a  b
0  1.0  2
1  2.0  3
2  3.0  4
3  4.0  5
4  5.0  6

In [64]:
dt

     a  b
0  1.0  2
1  2.0  3
2  3.0  4
3  4.0  5
4  5.0  6

In [65]:
dt['new']=dt.a.apply(lambda x: x*2)

In [66]:
dt.loc[0:1,["a","new"]]

     a  new
0  1.0  2.0
1  2.0  4.0

In [67]:
df=pd.DataFrame({"sex":["male","female"]})

In [68]:
df

      sex
0    male
1  female

In [69]:
df["new"]=df.sex.map({"male":1,"female":0})

In [70]:
df

      sex  new
0    male    1
1  female    0

In [71]:
df.sex.apply(len)

0    4
1    6
Name: sex, dtype: int64

## apply only for one column mean series

## applymap for dataframe two or more columns

In [72]:
df

      sex  new
0    male    1
1  female    0

In [73]:
df.sex=df.sex.map({"male":2,"female":1})

In [74]:
df

   sex  new
0    2    1
1    1    0

In [75]:
df=df.applymap(float)
df

   sex  new
0  2.0  1.0
1  1.0  0.0

In [84]:
df.sex=pd.to_numeric(df.sex,errors='      '

In [86]:
df.sex

0    2.0
1    1.0
Name: sex, dtype: float64

In [89]:
pd.to_datetime(df.new,unit="s")

0   1970-01-01 00:00:01
1   1970-01-01 00:00:00
Name: new, dtype: datetime64[ns]

In [90]:
pd.to_datetime(df.new,unit="D")  # it means value ko date bana rhe ho

0   1970-01-02
1   1970-01-01
Name: new, dtype: datetime64[ns]

In [91]:
pd.to_datetime(df.new,unit="Y")  # it means value ko year bna rhe ho

0   1971-01-01 05:49:12
1   1970-01-01 00:00:00
Name: new, dtype: datetime64[ns]

In [92]:
pd.to_datetime(df.new,unit="M")   # it means value ko month bna rhe ho

0   1970-01-31 10:29:06
1   1970-01-01 00:00:00
Name: new, dtype: datetime64[ns]

In [ ]:
pd.value_counts()